// // Створити змінну з іменем age і присвоїти їй значення свого віку. Вивести значення цієї змінної в консоль.

// // const age = 15;
// // console.log(age);

// // Створити змінну з іменем name і присвоїти їй значення свого імені. Вивести значення цієї змінної в консоль.

// // const name = "Maria";
// // console.log(name);

// // Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом. 
// // Вивести значення цієї змінної в консоль.

// // const isStudent = false;
// // console.log(isStudent);

// // Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою. Вивести цей рядок в консоль.

// const myString = "- Якось ризикнувши, можна залишитися щасливим на все життя 🎀💗";
// console.log(myString);

// // Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній 
// // результат додавання до неї числа 10. Вивести значення myNumber в консоль.

// const myNumber = 32;
// const addition = 10 + myNumber;
// console.log(addition);

// // Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

// const myNull = null;
// console.log(myNull);

// // Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). 
// // Після введення імені вивести повідомлення привітання з використанням введеного імені.

// const yourName = prompt("Введіть своє ім'я:");
// if (yourName){
//     alert("Привіт, " + yourName);
// }else{
//     alert("Дію відмінено!");
// }
// console.log(yourName);

// // Створити скрипт який виводить спливаюче підтвердження за допомогою confirm(). Якщо користувач підтверджує дію, 
// // вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

// const сonfirmation = confirm("Будь ласка, підтвердіть бронювання готелю");
// if (сonfirmation){
//     alert("Дякую за підтвердження");
// }else{
//     alert("Дію відмінено!");
// }
// console.log(сonfirmation);

// // Створити скрипт який виводить спливаюче попередження за допомогою alert(). Вивести повідомлення про те, що дія 
// // небезпечна та попросити користувача підтвердити дію за допомогою confirm(). Якщо користувач підтверджує дію, 
// // вивести повідомлення "Дякую за підтвердження!". Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

// alert("Увага! Ця дія може бути небезпечною.");
// const dangerousConfirmation = confirm("Ви впевнені, що хочете продовжити?");
// if (dangerousConfirmation){
//     alert("Дякую за підтвердження");
// }else{
//     alert("Дію відмінено!");
// }
// console.log(dangerousConfirmation);