// // Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія 
// // у Фаренгейти за допомогою формули та вивести результат в консоль.

// let celsius = 8;
// let fahrenheit = celsius * 1.8 + 32;
// console.log("Температура в Цельсіях:", celsius);
// console.log("Температура в Фаренгейтах:", fahrenheit);

// // Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці 
// // за допомогою оператора множення та вивести результат в консоль.

// let deysInMonth = 30;
// let hoursInMonth = deysInMonth * 24;
// let minutesInMonth = hoursInMonth * 60;
// console.log("Днів в місяці: ", deysInMonth);
// console.log("Годин в місяці", hoursInMonth);
// console.log("Хвилин в місяці", minutesInMonth);

// // Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії 
// // гравця за допомогою операторів віднімання та вивести результат в консоль.

// let health = 100;
// let energy = 100;
// health -= 50;
// energy -= 80;
// console.log("Рівень здоров'я: ", health);
// console.log("Рівень енергії: ", energy);

// // Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за 
// // допомогою оператора множення та вивести результат в консоль.

// let sum = 5368;
// let discount = sum * 0.10;
// let discountedSum = sum - discount; 
// console.log("Сума покупки: ", sum);
// console.log("Застосовано знижку в розмірі 10%: ", discountedSum);

// // Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення 
// // числа до меншого та вивести результат в консоль.

// let number = 50.74;
// console.log("Округлене число:", Math.floor(number));

// // Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() 
// // для перетворення рядка у десяткове число та вивести результат в консоль.

// let stringNumber = "53.27";
// console.log("Число з рядка (з плаваючою комою): ", Number.parseFloat(stringNumber));

// // Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для 
// // перетворення рядка у ціле число та вивести результат в консоль.

// let stringNumber2 = "12";
// console.log("Число з рядка: ", Number.parseInt(stringNumber2));

// // Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного 
// // кореня числа та вивести результат в консоль.

// let number2 = 16;
// console.log("Квадратний корінь числа: ", Math.sqrt(number2));

// // Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати 
// // метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати 
// // метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.

// let number3 = 45;
// let numberString = "120";
// console.log("Ціле число з рядка: ", Number.parseInt(numberString));
// console.log("Ціле число у рядок: ", number3.toString());
