// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

const number = 10;
let number2 = 1;
while (number2 <= number){
    console.log(number2);
    number2 +=1;
}

// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. 
// Якщо число не парне, пропустити його за допомогою continue.

const max = 20;  

for (let i = 2; i <= max; i += 1) {  
    if (i % 2 != 0){
        continue;
    }
console.log(i);
}

// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

const number3 = 7;  

for (let i = 1; i <= 10; i += 1) {  
    console.log(`${i} * ${number3} = `, number3 * i);  
}  

// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент 
// масиву за допомогою циклу while.

let number4 = 1;
const number5 = 5;
while (number4 <= number5){
    console.log(number4);
    number4 += 1;
}

// Створити масив із числами від 1 до 10. За допомогою циклу for пройтися 
// по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете 
// число 7, закінчити виконання циклу за допомогою оператора break.


for (let i = 1; i <= 10; i += 1) { 
    if(i === 7){
        break;
    }
    console.log(i);  
}  

// Створити скрипт, який виводить на екран всі числа, які менші за n. Якщо 
// зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений 
// за допомогою break.

let n = prompt("Введіть значення n: ");
n = parseInt(n);
for (let i = 0; i < n; i += 1) { 
    if(i >= n){
        break;
    }
    console.log(i);  
} 

// За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, 
// кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання 
// за допомогою оператора continue.

let number6 = 1;
const number7 = 20;
while (number6 <= number7){
    if(number6 % 3 === 0){
        number6 += 1;
        continue;
    }
    console.log(number6);
    number6 += 1;
}